# pandas modülü

Veri işleme ve veri temizleme de oldukçta verimli şekilde kullanılanbilen yanısıra veri analizi, veri mandeciliği ve makine öğrenmesi kullanılan bir modüldür. pandas modülü iki türlü veri tipi üzerine inşa edilmiştir: seriler ve DataFrame. Serileri tek boyutlu, DataFrame' leri de iki boyutlu diziler olarak düşünebiliriz. Join ve Groupby ile SQL tablolarındaki gibi sorgulamalar yapılabilir. .cvx, .xlsx gibi csv ve excel dosyalarından data çekerek çalışabilir ve tekrar bu formatlarda data dönüşümü yapılabilir.

Anaconda ile pandas otomaitkmen kurulur. Fakat eğer yüklenmemişse anaconda promt tan conda install pandas komutu ile Anacondaya dahil edilebilir. Python idle ya da VC Code kullanılıyorsa pip install pandas komutu ile yüklenebilir.

# pandas serileri

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Tanımlanma Yöntemleri - 1

In [3]:
labels_list = ["Hagi","Popescu","Tafarel","Okan Buruk","Bülent Korkmaz"]

In [4]:
data_list = [10,20,30,40,50]

pd.Series() cursor parantez içerisindeyken Shift+TAB' basılırsa

In [5]:
pd.Series()

C:\Users\x\AppData\Local\Temp/ipykernel_3932/2031691219.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

shift + TAB ile özellikleri görüebilir.

In [6]:
pd.Series(data = data_list)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
pd.Series(data = data_list, index = labels_list)

Hagi              10
Popescu           20
Tafarel           30
Okan Buruk        40
Bülent Korkmaz    50
dtype: int64

sıralı verilecekse data = tanımına gerek yoktur.

In [8]:
pd.Series(data_list, labels_list)

Hagi              10
Popescu           20
Tafarel           30
Okan Buruk        40
Bülent Korkmaz    50
dtype: int64

In [9]:
# Tanımlanma Yöntemleri - 2

herhangi bir index verilmediğinde, index otomatikman 0' dan başlar

In [10]:
pd.Series(data_list)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [11]:
npArray = np.array([100,200,300,400,500])

In [12]:
pd.Series(data = npArray)

0    100
1    200
2    300
3    400
4    500
dtype: int32

In [13]:
pd.Series(data = npArray,index = labels_list)

Hagi              100
Popescu           200
Tafarel           300
Okan Buruk        400
Bülent Korkmaz    500
dtype: int32

In [14]:
pd.Series(data = npArray,index = ["A","B","C","D","E"])

A    100
B    200
C    300
D    400
E    500
dtype: int32

In [15]:
# Tanımlanma Yöntemleri - 3

In [16]:
dataDict = {"Hagi":10,"Tafarel":80,"Aykut":11}

In [17]:
pd.Series(dataDict)

Hagi       10
Tafarel    80
Aykut      11
dtype: int64

# Seriler Üzerinde Operasyonlar

2019 ve 2020 yıllarındaki ihracat verileri (rastgele verilerdir)

In [18]:
s2019 = pd.Series([5,10,14,20],["Buğday","Mısır","Kiraz","Erik"])

In [19]:
s2020 = pd.Series([2,12,12,6],["Buğday","Mısır","Çilek","Erik"])

In [20]:
s2019

Buğday     5
Mısır     10
Kiraz     14
Erik      20
dtype: int64

In [21]:
s2020

Buğday     2
Mısır     12
Çilek     12
Erik       6
dtype: int64

In [22]:
s2019 + s2020

Buğday     7.0
Erik      26.0
Kiraz      NaN
Mısır     22.0
Çilek      NaN
dtype: float64

NaN : not a number

In [23]:
s2019["Buğday"] # Buğday'a karşılık gelen

5

In [24]:
s2020["Buğday"] # Buğday'a karşılık gelen

2

In [25]:
total = s2019 + s2020

In [26]:
total["Buğday"]

7.0

In [27]:
total["üzüm"]

KeyError: 'üzüm'

# Dataframelerin Tanımlanmaları

DataFrame' ler birçok serinin aynı kümede bulunmasıdır ve SQL tablolarına oldukça benzerdir. Böylece bu tablolar üzerinde işlem yapabiliriz.

In [28]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [29]:
randn(3,3)

array([[ 1.69237838,  0.58004123,  0.41387251],
       [-0.12943381, -1.40289781, -0.78507728],
       [-0.39774219,  1.92162736, -0.31146512]])

In [30]:
df = pd.DataFrame(randn(3,3),index = ["A","B","C"],
                  columns = ["sütun1","sütun2","sütun3"])
df

     sütun1    sütun2    sütun3
A -0.500170  1.789404  1.711015
B  0.065806 -1.318461  0.063162
C  0.503646  0.907505 -0.465492

In [31]:
df["sütun1"]

A   -0.500170
B    0.065806
C    0.503646
Name: sütun1, dtype: float64

In [32]:
df["sütun2"]

A    1.789404
B   -1.318461
C    0.907505
Name: sütun2, dtype: float64

In [33]:
type(df["sütun1"])

pandas.core.series.Series

satırları yani indexlere karşı gelen elemanları görmek için .loc() kullanılır.

In [34]:
df.loc["A"]

sütun1   -0.500170
sütun2    1.789404
sütun3    1.711015
Name: A, dtype: float64

In [35]:
type(df.loc["A"])

pandas.core.series.Series

In [36]:
df[["sütun1","sütun2"]]# DataFrame' i parçalama

     sütun1    sütun2
A -0.500170  1.789404
B  0.065806 -1.318461
C  0.503646  0.907505

# DataFrame'e Sütün Ekleme

In [37]:
df["sütun4"] = pd.Series(randn(3),index = ["A","B","C"])
df

     sütun1    sütun2    sütun3    sütun4
A -0.500170  1.789404  1.711015  0.374727
B  0.065806 -1.318461  0.063162  0.877045
C  0.503646  0.907505 -0.465492  0.370817

In [38]:
df["sütun5"] = df["sütun1"] + df["sütun2"] + df["sütun3"]
df

     sütun1    sütun2    sütun3    sütun4    sütun5
A -0.500170  1.789404  1.711015  0.374727  3.000250
B  0.065806 -1.318461  0.063162  0.877045 -1.189493
C  0.503646  0.907505 -0.465492  0.370817  0.945660

In [ ]:
# Dataframeden Sütün Silme

In [40]:
df.drop("sütun5") 
# Böyle verirsek default axis değeri 0 olduğu için index silmeye çalışacak.

KeyError: "['sütun5'] not found in axis"

In [41]:
df.drop("sütun5", axis = 1)

     sütun1    sütun2    sütun3    sütun4
A -0.500170  1.789404  1.711015  0.374727
B  0.065806 -1.318461  0.063162  0.877045
C  0.503646  0.907505 -0.465492  0.370817

In [42]:
df

     sütun1    sütun2    sütun3    sütun4    sütun5
A -0.500170  1.789404  1.711015  0.374727  3.000250
B  0.065806 -1.318461  0.063162  0.877045 -1.189493
C  0.503646  0.907505 -0.465492  0.370817  0.945660

In [43]:
df # değişiklikler yansımadı.

     sütun1    sütun2    sütun3    sütun4    sütun5
A -0.500170  1.789404  1.711015  0.374727  3.000250
B  0.065806 -1.318461  0.063162  0.877045 -1.189493
C  0.503646  0.907505 -0.465492  0.370817  0.945660

In [44]:
df.drop("sütun5", axis = 1, inplace=True)
df

     sütun1    sütun2    sütun3    sütun4
A -0.500170  1.789404  1.711015  0.374727
B  0.065806 -1.318461  0.063162  0.877045
C  0.503646  0.907505 -0.465492  0.370817

In [45]:
# Loc ve ILoc

In [46]:
df.loc["A"]

sütun1   -0.500170
sütun2    1.789404
sütun3    1.711015
sütun4    0.374727
Name: A, dtype: float64

In [47]:
df.iloc[0] # 0.index yani A

sütun1   -0.500170
sütun2    1.789404
sütun3    1.711015
sütun4    0.374727
Name: A, dtype: float64

In [48]:
df.loc["A","sütun1"]

-0.5001697108759089

In [49]:
df.loc[["A","B"],["sütun1","sütun2"]]

     sütun1    sütun2
A -0.500170  1.789404
B  0.065806 -1.318461

# DataFrame Filtreleme

In [50]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [52]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])
df

    Column1   Column2   Column3
A -0.712217 -0.958528 -2.680430
B -1.129760 -0.013495 -0.245745
C  0.411534  1.775285 -1.422886
D -0.116411 -1.082666  0.655786

In [53]:
df > -1

   Column1  Column2  Column3
A     True     True    False
B    False     True     True
C     True     True    False
D     True    False     True

In [54]:
booldf = df > 0
booldf

   Column1  Column2  Column3
A    False    False    False
B    False    False    False
C     True     True    False
D    False    False     True

In [55]:
df[booldf]

    Column1   Column2   Column3
A       NaN       NaN       NaN
B       NaN       NaN       NaN
C  0.411534  1.775285       NaN
D       NaN       NaN  0.655786

In [56]:
df[df > 0]

    Column1   Column2   Column3
A       NaN       NaN       NaN
B       NaN       NaN       NaN
C  0.411534  1.775285       NaN
D       NaN       NaN  0.655786

In [57]:
df

    Column1   Column2   Column3
A -0.712217 -0.958528 -2.680430
B -1.129760 -0.013495 -0.245745
C  0.411534  1.775285 -1.422886
D -0.116411 -1.082666  0.655786

In [58]:
df["Column1"]

A   -0.712217
B   -1.129760
C    0.411534
D   -0.116411
Name: Column1, dtype: float64

In [59]:
df["Column1"] > -1

A     True
B    False
C     True
D     True
Name: Column1, dtype: bool

In [60]:
df[df["Column1"] > -1]

    Column1   Column2   Column3
A -0.712217 -0.958528 -2.680430
C  0.411534  1.775285 -1.422886
D -0.116411 -1.082666  0.655786

A ve B indeksleri false olduğundan df içinde filtreleme yapılan üst sorguda A ve B doğrudan filtrelenmiş oldu.

In [61]:
df

    Column1   Column2   Column3
A -0.712217 -0.958528 -2.680430
B -1.129760 -0.013495 -0.245745
C  0.411534  1.775285 -1.422886
D -0.116411 -1.082666  0.655786

In [62]:
df["Column1"] > 0.5

A    False
B    False
C    False
D    False
Name: Column1, dtype: bool

In [63]:
df[df["Column1"] > 0.5]

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [64]:
df["Column2"] > 0.5

A    False
B    False
C     True
D    False
Name: Column2, dtype: bool

In [65]:
df[df["Column2"] > 0.5]

    Column1   Column2   Column3
C  0.411534  1.775285 -1.422886

In [66]:
df

    Column1   Column2   Column3
A -0.712217 -0.958528 -2.680430
B -1.129760 -0.013495 -0.245745
C  0.411534  1.775285 -1.422886
D -0.116411 -1.082666  0.655786

In [67]:
df[df["Column1"] > -1]

    Column1   Column2   Column3
A -0.712217 -0.958528 -2.680430
C  0.411534  1.775285 -1.422886
D -0.116411 -1.082666  0.655786

In [68]:
df[df["Column2"] > -1]

    Column1   Column2   Column3
A -0.712217 -0.958528 -2.680430
B -1.129760 -0.013495 -0.245745
C  0.411534  1.775285 -1.422886

In [69]:
df[(df["Column1"] > -1) & (df["Column2"] > 0)]

    Column1   Column2   Column3
C  0.411534  1.775285 -1.422886

In [70]:
df[(df["Column1"] > -1) | (df["Column2"] > 0)]

    Column1   Column2   Column3
A -0.712217 -0.958528 -2.680430
C  0.411534  1.775285 -1.422886
D -0.116411 -1.082666  0.655786

In [71]:
| # alt gr + tire

SyntaxError: invalid syntax (Temp/ipykernel_3932/1982137869.py, line 1)

In [73]:
df

    Column1   Column2   Column3
A -0.712217 -0.958528 -2.680430
B -1.129760 -0.013495 -0.245745
C  0.411534  1.775285 -1.422886
D -0.116411 -1.082666  0.655786

In [74]:
df["Column4"] = pd.Series(randn(4),index = ["A","B","C","D"])
df

    Column1   Column2   Column3   Column4
A -0.712217 -0.958528 -2.680430 -0.323358
B -1.129760 -0.013495 -0.245745 -0.226060
C  0.411534  1.775285 -1.422886  1.462249
D -0.116411 -1.082666  0.655786 -0.136957

In [75]:
df["Column5"] = randn(4)
df

    Column1   Column2   Column3   Column4   Column5
A -0.712217 -0.958528 -2.680430 -0.323358 -1.083011
B -1.129760 -0.013495 -0.245745 -0.226060  0.281949
C  0.411534  1.775285 -1.422886  1.462249 -1.257240
D -0.116411 -1.082666  0.655786 -0.136957  0.826398

In [76]:
df["Column6"] = ["newValue1","newValue2","newValue3","newValue4"]
df

    Column1   Column2   Column3   Column4   Column5    Column6
A -0.712217 -0.958528 -2.680430 -0.323358 -1.083011  newValue1
B -1.129760 -0.013495 -0.245745 -0.226060  0.281949  newValue2
C  0.411534  1.775285 -1.422886  1.462249 -1.257240  newValue3
D -0.116411 -1.082666  0.655786 -0.136957  0.826398  newValue4

In [ ]:
# indexleri yeni eklenen Column6 ile değiiştirmek için .set.index(sütun adı)

In [77]:
df.set_index("Column6")

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1 -0.712217 -0.958528 -2.680430 -0.323358 -1.083011
newValue2 -1.129760 -0.013495 -0.245745 -0.226060  0.281949
newValue3  0.411534  1.775285 -1.422886  1.462249 -1.257240
newValue4 -0.116411 -1.082666  0.655786 -0.136957  0.826398

In [78]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A -0.712217 -0.958528 -2.680430 -0.323358 -1.083011  newValue1
B -1.129760 -0.013495 -0.245745 -0.226060  0.281949  newValue2
C  0.411534  1.775285 -1.422886  1.462249 -1.257240  newValue3
D -0.116411 -1.082666  0.655786 -0.136957  0.826398  newValue4

In [79]:
df.set_index("Column6",inplace = True)
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1 -0.712217 -0.958528 -2.680430 -0.323358 -1.083011
newValue2 -1.129760 -0.013495 -0.245745 -0.226060  0.281949
newValue3  0.411534  1.775285 -1.422886  1.462249 -1.257240
newValue4 -0.116411 -1.082666  0.655786 -0.136957  0.826398

In [80]:
df.index.names # Indekslerin ismi

FrozenList(['Column6'])

# DF multiindex

In [81]:
outerIndex = ["Group1","Group1","Group1","Group2","Group2","Group2","Group3","Group3","Group3"]
outerIndex

['Group1',
 'Group1',
 'Group1',
 'Group2',
 'Group2',
 'Group2',
 'Group3',
 'Group3',
 'Group3']

In [82]:
innerIndex = ["Index1","Index2","Index3","Index1","Index2","Index3","Index1","Index2","Index3"]
innerIndex

['Index1',
 'Index2',
 'Index3',
 'Index1',
 'Index2',
 'Index3',
 'Index1',
 'Index2',
 'Index3']

In [83]:
list(zip(outerIndex,innerIndex)) # zip ile demet şeklinde birleştirme yapabiliyoruz.

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [85]:
hi = list(zip(outerIndex,innerIndex))
hi = pd.MultiIndex.from_tuples(hi)
hi

MultiIndex([('Group1', 'Index1'),
            ('Group1', 'Index2'),
            ('Group1', 'Index3'),
            ('Group2', 'Index1'),
            ('Group2', 'Index2'),
            ('Group2', 'Index3'),
            ('Group3', 'Index1'),
            ('Group3', 'Index2'),
            ('Group3', 'Index3')],
           )

In [86]:
df = pd.DataFrame(randn(9,3),hi,columns = ["A","B","C"])
df

                      A         B         C
Group1 Index1  2.049945  1.057680  1.215750
       Index2  0.192674 -0.239289  0.254217
       Index3  0.829627  1.162678 -0.103204
Group2 Index1  1.426104 -0.536041 -1.268183
       Index2  1.448210  0.419827  0.004195
       Index3 -1.858079  0.277891  0.647124
Group3 Index1  1.460414  0.245824  1.063187
       Index2 -0.144145  1.925951  0.175610
       Index3 -0.956586  0.351379 -3.336132

In [87]:
df["A"]

Group1  Index1    2.049945
        Index2    0.192674
        Index3    0.829627
Group2  Index1    1.426104
        Index2    1.448210
        Index3   -1.858079
Group3  Index1    1.460414
        Index2   -0.144145
        Index3   -0.956586
Name: A, dtype: float64

In [88]:
df.loc["Group1"]

               A         B         C
Index1  2.049945  1.057680  1.215750
Index2  0.192674 -0.239289  0.254217
Index3  0.829627  1.162678 -0.103204

In [89]:
df.loc[["Group1","Group2"]]

                      A         B         C
Group1 Index1  2.049945  1.057680  1.215750
       Index2  0.192674 -0.239289  0.254217
       Index3  0.829627  1.162678 -0.103204
Group2 Index1  1.426104 -0.536041 -1.268183
       Index2  1.448210  0.419827  0.004195
       Index3 -1.858079  0.277891  0.647124

In [90]:
df.loc["Group1"].loc["Index1"]

A    2.049945
B    1.057680
C    1.215750
Name: Index1, dtype: float64

In [91]:
df.loc["Group1"].loc["Index1"]["A"]

2.049944850951892

In [92]:
df.index.names = ["Groups","Indexes"]
df

                       A         B         C
Groups Indexes
Group1 Index1   2.049945  1.057680  1.215750
       Index2   0.192674 -0.239289  0.254217
       Index3   0.829627  1.162678 -0.103204
Group2 Index1   1.426104 -0.536041 -1.268183
       Index2   1.448210  0.419827  0.004195
       Index3  -1.858079  0.277891  0.647124
Group3 Index1   1.460414  0.245824  1.063187
       Index2  -0.144145  1.925951  0.175610
       Index3  -0.956586  0.351379 -3.336132

# .xs()

In [94]:
df.xs("Group1")

                A         B         C
Indexes
Index1   2.049945  1.057680  1.215750
Index2   0.192674 -0.239289  0.254217
Index3   0.829627  1.162678 -0.103204

In [95]:
df.xs("Group1").xs("Index1")

A    2.049945
B    1.057680
C    1.215750
Name: Index1, dtype: float64

In [96]:
df.xs("Group1").xs("Index1").xs("A")

2.049944850951892

In [97]:
df.xs("Index1", level = "Indexes") #level belirterek içeriden de gezebiliriz.

               A         B         C
Groups
Group1  2.049945  1.057680  1.215750
Group2  1.426104 -0.536041 -1.268183
Group3  1.460414  0.245824  1.063187